In [ ]:
##############################################

In [ ]:
#select only the first10 rows
import pandas as pd
data =  pd.read_csv('datasets/groupdata.csv')
data.head(10)

In [ ]:
# Select only the columns: name, age, group.
data[['name','age','group']]

In [28]:
# Select all students who are in group A.
data[data.group == 'group A']

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group A,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group A,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group A,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group A,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group A,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group A,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group A,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group A,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group A,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group A,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group A,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group A,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [29]:
# Select all students with age > 40.
data[data.age > 40]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group A,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
7,MS08,Idrees,51,Multan,MORNING,group A,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group A,Male,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [35]:
# Q5: Select all Female students in group B.
data[(data.group == 'group B' )& (data.gender == 'Female') ]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,MS03,Shaista,35,Karachi,AFTERNOON,group A,Female,64.9,75.1,8500.0
4,MS05,Zara,40,Peshawer,AFT,group A,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group A,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group A,Female,90.2,NaN,4000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group A,Female,90.5,81.3,3500.0

In [68]:
#Using .loc, select all rows where session is 'MORNING' and only return the columns:
# name, session, scholarship.
data.loc[data['session']=='MORNING',['name','session','scholarship']]

       name  session  scholarship
0      Rauf  MORNING       5000.0
5     Mohid  MORNING          NaN
7    Idrees  MORNING       8000.0
12  Mujahid  MORNING       7000.0

In [48]:
# 7. Using .iloc[]
# Q7: Using .iloc, return rows 5 to 10 and columns 3 to 6
data.iloc[[5,10],[3,6]]

      address  gender
5      Lahore  Female
10  Islamabad    Male

In [50]:
data1 = data.sort_values('subj1')
data1

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,MS03,Shaista,35,Karachi,AFTERNOON,group A,Female,64.9,75.1,8500.0
4,MS05,Zara,40,Peshawer,AFT,group A,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group A,Female,69.3,78.6,NaN
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
0,MS01,Rauf,52,Lahore,MORNING,group A,Male,78.3,84.4,5000.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
7,MS08,Idrees,51,Multan,MORNING,group A,Male,84.1,76.0,8000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
6,MS07,Zobia,40,Sialkot,AFT,group A,Female,90.2,NaN,4000.0
8,MS09,Jamil,53,Karachi,AFT,group A,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group A,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group A,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group A,Male,90.5,81.3,NaN
14,MS15,Fatima,33,Sialkot,AFT,group A,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
12,MS13,Mujahid,18,Lahore,MORNING,group A,Male,NaN,76.5,7000.0

In [64]:
data2= [data.subj1 > data.subj2]
data2

[0     False
 1      True
 2     False
 3     False
 4     False
 5     False
 6     False
 7      True
 8      True
 9      True
 10     True
 11     True
 12    False
 13     True
 14     True
 15     True
 dtype: bool]

In [65]:
data.loc[data.subj1> data.subj2 , ['name', 'subj1', 'subj2' ]]

         name  subj1  subj2
1        Arif   70.5   60.5
7      Idrees   84.1   76.0
8       Jamil   90.5   81.3
9      Shahid   90.5   81.3
10    Khurram   90.5   81.3
11       Maaz   90.5   81.3
13       Sara   84.1   76.0
14     Fatima   90.5   81.3
15  Kakamanna   90.5   81.3

In [67]:
data.set_index(keys ='roll no')

,name,age,address,session,group,gender,subj1,subj2,scholarship
roll no,,,,,,,,,
MS01,Rauf,52,Lahore,MORNING,group A,Male,78.3,84.4,5000.0
MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
MS03,Shaista,35,Karachi,AFTERNOON,group A,Female,64.9,75.1,8500.0
MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
MS05,Zara,40,Peshawer,AFT,group A,Female,65.9,72.8,3500.0
MS06,Mohid,16,Lahore,MORNING,group A,Female,69.3,78.6,NaN
MS07,Zobia,40,Sialkot,AFT,group A,Female,90.2,NaN,4000.0
MS08,Idrees,51,Multan,MORNING,group A,Male,84.1,76.0,8000.0
MS09,Jamil,53,Karachi,AFT,group A,Male,90.5,81.3,3500.0
MS10,Shahid,38,Lahore,AFTERNOON,group A,Male,90.5,81.3,3800.0
MS11,Khurram,35,Islamabad,MOR,group A,Male,90.5,81.3,6000.0
MS12,Maaz,25,Karachi,AFTERNOON,group A,Male,90.5,81.3,NaN
MS13,Mujahid,18,Lahore,MORNING,group A,Male,NaN,76.5,7000.0
MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
MS15,Fatima,33,Sialkot,AFT,group A,Female,90.5,81.3,3500.0
MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [77]:
#Xxxxxxxxxxxxxxxxxxxxxxx

In [76]:
# 1. Select rows based on multiple column values
data[(data.gender == 'Male' )&(data.session.isin(['AFTERNOON', 'AFT']))]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
8,MS09,Jamil,53,Karachi,AFT,group A,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group A,Male,90.5,81.3,3800.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group A,Male,90.5,81.3,NaN
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [93]:
# 2 Filter using .isin()
data.loc[data['group'].isin(['group A', 'group C']), ['name', 'group']]

         name    group
0        Rauf  group A
1        Arif  group A
2     Shaista  group A
3      Hadeed  group A
4        Zara  group A
5       Mohid  group A
6       Zobia  group A
7      Idrees  group A
8       Jamil  group A
9      Shahid  group A
10    Khurram  group A
11       Maaz  group A
12    Mujahid  group A
13       Sara  group A
14     Fatima  group A
15  Kakamanna  group A